-- phpMyAdmin SQL Dump
-- version 4.8.3
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 21, 2020 at 08:16 AM
-- Server version: 10.1.36-MariaDB
-- PHP Version: 7.0.32

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `login_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `appdata`
--

CREATE TABLE `appdata` (
  `id` varchar(10) NOT NULL,
  `appname` varchar(255) NOT NULL,
  `contact_point` varchar(100) NOT NULL,
  `project_start` varchar(30) NOT NULL,
  `project_end` varchar(30) NOT NULL,
  `description` varchar(255) NOT NULL,
  `status` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `appdata`
--

INSERT INTO `appdata` (`id`, `appname`, `contact_point`, `project_start`, `project_end`, `description`, `status`) VALUES
('25879401', 'ระบบประเมินความเสี่ยงและ สิ่งแวดล้อม ชฟน.', 'หพรส-ผ. กพส-ผ. อวท. โทร.64428', '2020-02-19', '', 'ระบบจัดเก็บข้อมูล กิจกรรม/งาน พื้นที่ แหล่งอันตราย ลักษณะการเกิดเหตุ ปัญหาสิ่งแวดล้อม และทรัพยากรภายในสายงาน ชฟน.', 'กำลังดำเนินการ'),
('258794023', 'ระบบข้อร้องเรียน ISO', 'นายไพศาล วัชรถาวรศักดิ์ - 04-7', '2018-05-21', '', 'ฐานข้อมูลการร้องเรียนต่ำกว่ามาตรฐานและการติดตามการแก้ไข', 'ดำเนินการเสร็จสิ้น'),
('25879407', 'Balloon Office', 'สุมาลี,กัลยา,พิชา', '2019-07-19', '', 'ระบบจองห้องประชุมออนไลน์, ติดตามความก้าวหน้า และรายงานแผนปฏิบัติการ', 'กำลังดำเนินการ'),
('25879412', 'ระบบประเมินความเสี่ยงและ สิ่งแวดล้อม ชฟน.', 'หพรส-ผ. กพส-ผ. อวท. โทร.64428', '2020-02-29', '', 'ระบบจัดเก็บข้อมูล กิจกรรม/งาน พื้นที่ แหล่งอันตราย ลักษณะการเกิดเหตุ ปัญหาสิ่งแวดล้อม และทรัพยากรภายในสายงาน ชฟน.', 'กำลังดำเนินการ'),
('25879422', 'ระบบประเมินความเสี่ยงและ สิ่งแวดล้อม ชฟน.', 'หพรส-ผ. กพส-ผ. อวท. โทร.64428', '2019-10-12', '', 'ระบบจัดเก็บข้อมูล กิจกรรม/งาน พื้นที่ แหล่งอันตราย ลักษณะการเกิดเหตุ ปัญหาสิ่งแวดล้อม และทรัพยากรภายในสายงาน ชฟน.', 'ดำเนินการเสร็จสิ้น'),
('25879444', 'Log Station', 'นายสุรเดช ปัทมสิริวัฒน์ - 04-7', '2020-02-04', '', 'ระบบข้อมูลเหตุการณ์การเดินเครื่อง (Event/ Action/ VPSER Log)', 'ยังไม่แล้วเสร็จ'),
('25879446', 'Shared Documents', 'นายศิริชัย ปราบศรีภูมิ - 771-4', '2019-02-08', '', 'ระบบจัดเก็บเอกสารและข้อมูล', 'ดำเนินการเสร็จสิ้น'),
('25879455', 'ระบบประเมินความเสี่ยงและ สิ่งแวดล้อม ชฟน.', 'หพรส-ผ. กพส-ผ. อวท. โทร.64428', '2020-01-17', '', 'ระบบจัดเก็บข้อมูล กิจกรรม/งาน พื้นที่ แหล่งอันตราย ลักษณะการเกิดเหตุ ปัญหาสิ่งแวดล้อม และทรัพยากรภายในสายงาน ชฟน.', 'กำลังดำเนินการ'),
('25879466', 'เว็บไซต์โรงไฟฟ้าแม่เมาะ', 'นายสุนทร ดาวประเสริฐ -04-744-2', '2020-02-12', '', 'เว็บไซต์โรงไฟฟ้าแม่เมาะสำหรับบุคคลภายนอก macmoh.egat.com', 'ดำเนินการเสร็จสิ้น'),
('25879499', 'Smart PM', 'นายสุรเดช ปัทมสิริวัฒน์ - 04-7', '2020-02-04', '', 'ระบบการออก PM อัตโนมัติจากข้อมูลการทำงานอุปกรณ์', 'กำลังดำเนินการ'),
('78945610', 'ระบบประเมินความเสี่ยงและ สิ่งแวดล้อม ชฟน.', 'หพรส-ผ. กพส-ผ. อวท. โทร.64428', '2020-02-10', '', 'ระบบจัดเก็บข้อมูล กิจกรรม/งาน พื้นที่ แหล่งอันตราย ลักษณะการเกิดเหตุ ปัญหาสิ่งแวดล้อม และทรัพยากรภายในสายงาน ชฟน.', 'ดำเนินการเสร็จสิ้น');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `appdata`
--
ALTER TABLE `appdata`
  ADD PRIMARY KEY (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
