-- phpMyAdmin SQL Dump
-- version 4.8.3
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 12, 2020 at 09:56 AM
-- Server version: 10.1.36-MariaDB
-- PHP Version: 7.0.32

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `application_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `appdata`
--

CREATE TABLE `appdata` (
  `id` varchar(10) NOT NULL,
  `appname` varchar(255) NOT NULL,
  `contact_point` varchar(100) NOT NULL,
  `phone_number` varchar(10) NOT NULL,
  `project_start` date NOT NULL,
  `project_end` date NOT NULL,
  `description` varchar(255) NOT NULL,
  `status` varchar(50) NOT NULL,
  `detail_name` varchar(255) NOT NULL,
  `percent` int(10) NOT NULL,
  `date_start` date NOT NULL,
  `date_complete` date NOT NULL,
  `date_end` date NOT NULL,
  `total` int(10) NOT NULL,
  `detail_name_1` varchar(255) NOT NULL,
  `percent_1` int(10) NOT NULL,
  `date_start_1` date NOT NULL,
  `date_complete_1` date NOT NULL,
  `date_end_1` date NOT NULL,
  `total_1` int(10) NOT NULL,
  `detail_name_2` varchar(255) NOT NULL,
  `percent_2` int(10) NOT NULL,
  `date_start_2` date NOT NULL,
  `date_complete_2` date NOT NULL,
  `date_end_2` date NOT NULL,
  `total_2` int(10) NOT NULL,
  `detail_name_3` varchar(255) NOT NULL,
  `percent_3` int(10) NOT NULL,
  `date_start_3` date NOT NULL,
  `date_complete_3` date NOT NULL,
  `date_end_3` date NOT NULL,
  `total_3` int(10) NOT NULL,
  `detail_name_4` varchar(255) NOT NULL,
  `percent_4` int(10) NOT NULL,
  `date_start_4` date NOT NULL,
  `date_complete_4` date NOT NULL,
  `date_end_4` date NOT NULL,
  `total_4` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `appdata`
--

INSERT INTO `appdata` (`id`, `appname`, `contact_point`, `phone_number`, `project_start`, `project_end`, `description`, `status`, `detail_name`, `percent`, `date_start`, `date_complete`, `date_end`, `total`, `detail_name_1`, `percent_1`, `date_start_1`, `date_complete_1`, `date_end_1`, `total_1`, `detail_name_2`, `percent_2`, `date_start_2`, `date_complete_2`, `date_end_2`, `total_2`, `detail_name_3`, `percent_3`, `date_start_3`, `date_complete_3`, `date_end_3`, `total_3`, `detail_name_4`, `percent_4`, `date_start_4`, `date_complete_4`, `date_end_4`, `total_4`) VALUES
('15987691', 'Log Station', 'นายสุรเดช ปัทมสิริวัฒน์ - 04-744-3511', '0816162762', '2020-02-04', '2020-02-04', 'ระบบข้อมูลเหตุการณ์การเดินเครื่อง (Event/ Action/ VPSER Log)', 'กำลังดำเนินการ', '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0),
('15987693', 'Maemoh Home (Web Application)	', 'สุมาลี,กัลยา,พิชา', '', '2020-02-06', '2020-02-10', 'ให้บริการ Web Site หทสม-ฟ.', 'ดำเนินการเสร็จสิ้น', '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0),
('15987694', 'เวปไซต์ฝ่ายเดินเครื่องโรงไฟฟ้าแม่เมาะ อฟม.', 'นางสาวอ้อมรัก วงษ์ทิม 04-743-2066', '', '2020-01-16', '2020-02-14', 'เวปไซต์ฝ่ายเดินเครื่องโรงไฟฟ้าแม่เมาะ อฟม.', 'ดำเนินการเสร็จสิ้น', '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0),
('15987698', 'โปรแกรมสืบค้นข้อมูล EDMS', 'นายพิชิต กฤตเวทิน - 02-754-2012', '', '2020-02-09', '2020-02-23', 'ระบบสืบค้นข้อมูลคำสั่งเดินทางจากระบบ EDMS', 'ยังไม่แล้วเสร็จ', '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0),
('25879401', 'ระบบประเมินความเสี่ยงและ สิ่งแวดล้อม ชฟน.', 'หพรส-ผ. กพส-ผ. อวท. โทร.64428', '', '2020-02-19', '2020-02-19', 'ระบบจัดเก็บข้อมูล กิจกรรม/งาน พื้นที่ แหล่งอันตราย ลักษณะการเกิดเหตุ ปัญหาสิ่งแวดล้อม และทรัพยากรภายในสายงาน ชฟน.', 'กำลังดำเนินการ', '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0),
('25879402', 'ระบบข้อร้องเรียน ISO', 'นายไพศาล วัชรถาวรศักดิ์ - 04-7', '', '2018-05-21', '2020-02-21', 'ฐานข้อมูลการร้องเรียนต่ำกว่ามาตรฐานและการติดตามการแก้ไข', 'ดำเนินการเสร็จสิ้น', '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0),
('25879407', 'Balloon Office', 'สุมาลี,กัลยา,พิชา', '', '2019-07-19', '2020-02-21', 'ระบบจองห้องประชุมออนไลน์, ติดตามความก้าวหน้า และรายงานแผนปฏิบัติการ', 'ดำเนินการเสร็จสิ้น', '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0),
('25879412', 'ระบบประเมินความเสี่ยงและ สิ่งแวดล้อม ชฟน.', 'หพรส-ผ. กพส-ผ. อวท. โทร.64428', '', '2020-02-29', '2020-03-28', 'ระบบจัดเก็บข้อมูล กิจกรรม/งาน พื้นที่ แหล่งอันตราย ลักษณะการเกิดเหตุ ปัญหาสิ่งแวดล้อม และทรัพยากรภายในสายงาน ชฟน.', 'กำลังดำเนินการ', '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0),
('25879422', 'ระบบประเมินความเสี่ยงและ สิ่งแวดล้อม ชฟน.', 'หพรส-ผ. กพส-ผ. อวท. โทร.64428', '', '2019-10-12', '2019-11-28', 'ระบบจัดเก็บข้อมูล กิจกรรม/งาน พื้นที่ แหล่งอันตราย ลักษณะการเกิดเหตุ ปัญหาสิ่งแวดล้อม และทรัพยากรภายในสายงาน ชฟน.', 'ดำเนินการเสร็จสิ้น', '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0),
('25879446', 'Shared Documents', 'นายศิริชัย ปราบศรีภูมิ - 771-4', '', '2019-02-08', '2019-04-26', 'ระบบจัดเก็บเอกสารและข้อมูล', 'กำลังดำเนินการ', '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0),
('25879455', 'ระบบประเมินความเสี่ยงและ สิ่งแวดล้อม ชฟน.', 'หพรส-ผ. กพส-ผ. อวท. โทร.64428', '', '2020-01-17', '2020-03-29', 'ระบบจัดเก็บข้อมูล กิจกรรม/งาน พื้นที่ แหล่งอันตราย ลักษณะการเกิดเหตุ ปัญหาสิ่งแวดล้อม และทรัพยากรภายในสายงาน ชฟน.', 'กำลังดำเนินการ', '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0),
('25879466', 'เว็บไซต์โรงไฟฟ้าแม่เมาะ', 'นายสุนทร ดาวประเสริฐ -04-744-2', '', '2020-02-12', '2020-02-12', 'เว็บไซต์โรงไฟฟ้าแม่เมาะสำหรับบุคคลภายนอก macmoh.egat.com', 'ดำเนินการเสร็จสิ้น', '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0),
('25879499', 'Smart PM', 'นายสุรเดช ปัทมสิริวัฒน์ - 04-7', '', '2020-02-04', '2020-02-29', 'ระบบการออก PM อัตโนมัติจากข้อมูลการทำงานอุปกรณ์', 'กำลังดำเนินการ', '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0, '', 0, '0000-00-00', '0000-00-00', '0000-00-00', 0);

-- --------------------------------------------------------

--
-- Table structure for table `inventoryapp`
--

CREATE TABLE `inventoryapp` (
  `id` varchar(10) NOT NULL,
  `appname` varchar(255) NOT NULL,
  `contact_point` varchar(100) NOT NULL,
  `phone_number` varchar(10) NOT NULL,
  `project_start` date NOT NULL,
  `project_end` date NOT NULL,
  `description` varchar(255) NOT NULL,
  `url` varchar(255) NOT NULL,
  `status` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `inventoryapp`
--

INSERT INTO `inventoryapp` (`id`, `appname`, `contact_point`, `phone_number`, `project_start`, `project_end`, `description`, `url`, `status`) VALUES
('15986634', 'โปรแกรมทำรายงาน Battery', 'นายพิชิต กฤตเวทิน - 02-754-2012', '', '2020-01-03', '2020-01-03', 'โปรแกรมทำรายงาน Battery', 'https://www.egat.co.th/', 'Active'),
('15987690', 'เว็ปไซต์ข้อมูลบริการภายนอกเขื่อนศรีนครินทร์ www.snr.egat.com', 'นายนุ วิริยาลัย - 711-2006', '', '2020-02-25', '2020-02-25', 'เว็ปไซต์ข้อมูลบริการภายนอกเขื่อนศรีนครินทร์', 'http://www.snr.egat.com', 'Active'),
('15987691', 'Log Station', 'นายสุรเดช ปัทมสิริวัฒน์ - 04-744-3511', '0816162762', '2020-02-04', '2020-02-04', 'ระบบข้อมูลเหตุการณ์การเดินเครื่อง (Event/ Action/ VPSER Log)', 'http://maemoh.egat.co.th/mmp/?option=com_content&task=view&id=30&Itemid=262', 'Active'),
('15987693', 'Maemoh Home (Web Application)	', 'สุมาลี,กัลยา,พิชา', '', '2020-02-06', '2020-02-06', 'ให้บริการ Web Site หทสม-ฟ.', '', 'Active'),
('15987694', 'เวปไซต์ฝ่ายเดินเครื่องโรงไฟฟ้าแม่เมาะ อฟม.', 'นางสาวอ้อมรัก วงษ์ทิม 04-743-2066', '', '2020-01-16', '2020-01-16', 'เวปไซต์ฝ่ายเดินเครื่องโรงไฟฟ้าแม่เมาะ อฟม.', '', 'Active'),
('15987698', 'โปรแกรมสืบค้นข้อมูล EDMS', 'นายพิชิต กฤตเวทิน - 02-754-2012', '', '2020-02-09', '2020-02-09', 'ระบบสืบค้นข้อมูลคำสั่งเดินทางจากระบบ EDMS', 'http://10.222.1.154/edms/edms2.asp', 'Active'),
('25879401', 'ระบบประเมินความเสี่ยงและ สิ่งแวดล้อม ชฟน.', 'หพรส-ผ. กพส-ผ. อวท. โทร.64428', '0816162956', '2020-02-19', '2020-02-19', 'ระบบจัดเก็บข้อมูล กิจกรรม/งาน พื้นที่ แหล่งอันตราย ลักษณะการเกิดเหตุ ปัญหาสิ่งแวดล้อม และทรัพยากรภายในสายงาน ชฟน.', '', 'Active'),
('25879402', 'ระบบข้อร้องเรียน ISO', 'นายไพศาล วัชรถาวรศักดิ์ - 04-7', '', '2018-05-21', '2018-05-21', 'ฐานข้อมูลการร้องเรียนต่ำกว่ามาตรฐานและการติดตามการแก้ไข', '', 'Active'),
('25879407', 'Balloon Office', 'สุมาลี,กัลยา,พิชา', '', '2019-07-19', '2019-07-19', 'ระบบจองห้องประชุมออนไลน์, ติดตามความก้าวหน้า และรายงานแผนปฏิบัติการ', '', 'Active'),
('25879412', 'ระบบประเมินความเสี่ยงและ สิ่งแวดล้อม ชฟน.', 'หพรส-ผ. กพส-ผ. อวท. โทร.64428', '', '2020-02-29', '2020-02-29', 'ระบบจัดเก็บข้อมูล กิจกรรม/งาน พื้นที่ แหล่งอันตราย ลักษณะการเกิดเหตุ ปัญหาสิ่งแวดล้อม และทรัพยากรภายในสายงาน ชฟน.', '', 'Active'),
('25879422', 'ระบบประเมินความเสี่ยงและ สิ่งแวดล้อม ชฟน.', 'หพรส-ผ. กพส-ผ. อวท. โทร.64428', '0816162762', '2019-10-12', '2019-10-12', 'ระบบจัดเก็บข้อมูล กิจกรรม/งาน พื้นที่ แหล่งอันตราย ลักษณะการเกิดเหตุ ปัญหาสิ่งแวดล้อม และทรัพยากรภายในสายงาน ชฟน.', '', 'Active'),
('25879446', 'Shared Documents', 'นายศิริชัย ปราบศรีภูมิ - 771-4', '', '2019-02-08', '2019-02-08', 'ระบบจัดเก็บเอกสารและข้อมูล', '', 'Active'),
('25879455', 'ระบบประเมินความเสี่ยงและ สิ่งแวดล้อม ชฟน.', 'หพรส-ผ. กพส-ผ. อวท. โทร.64428', '', '2020-01-17', '2020-01-17', 'ระบบจัดเก็บข้อมูล กิจกรรม/งาน พื้นที่ แหล่งอันตราย ลักษณะการเกิดเหตุ ปัญหาสิ่งแวดล้อม และทรัพยากรภายในสายงาน ชฟน.', '', 'Active'),
('25879466', 'เว็บไซต์โรงไฟฟ้าแม่เมาะ', 'นายสุนทร ดาวประเสริฐ -04-744-2', '', '2020-02-12', '2020-02-12', 'เว็บไซต์โรงไฟฟ้าแม่เมาะสำหรับบุคคลภายนอก macmoh.egat.com', '', 'Active'),
('25879499', 'Smart PM', 'นายสุรเดช ปัทมสิริวัฒน์ - 04-7', '', '2020-02-04', '2020-02-04', 'ระบบการออก PM อัตโนมัติจากข้อมูลการทำงานอุปกรณ์', '', 'Active');

-- --------------------------------------------------------

--
-- Table structure for table `login`
--

CREATE TABLE `login` (
  `ID` int(11) NOT NULL,
  `username` varchar(100) NOT NULL,
  `password` varchar(100) NOT NULL,
  `name` varchar(100) NOT NULL,
  `level` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `login`
--

INSERT INTO `login` (`ID`, `username`, `password`, `name`, `level`) VALUES
(1, 'bass1230', '111', 'Saharat Sakhaunsit', 'ADMIN'),
(2, '222', '222', 'Surasit SongA', 'Member');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `appdata`
--
ALTER TABLE `appdata`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `inventoryapp`
--
ALTER TABLE `inventoryapp`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `login`
--
ALTER TABLE `login`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `login`
--
ALTER TABLE `login`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
